{
  "data": {
    "task_name": "aero__fw_classification_v1",
    "task_description": {
      "en" : "<div class=\"anchor\" id=\"data-source\"></div>\n\n### 1.1. Domain context\n\n\n### 1.1.1 Introduction\n\nLarge number of sensors parameters and events messages comes from different sources during aircraft flights. Some of them may indicate potential problems related to aircraft health and require maintenance diagnostic and repair. It is more cost effective to employ a predictive fault detection method early to examine and fix those latent problems. Thus, the maintenance cost is cheaper.\n\n\n### 1.1.2 Data sources\n\nThe task is provided with multiple data sources:\n\n* `flights` - flight schedules from airline.\n* `cfds_events` - messages from CFDS system (Centralized Fault Display System). The purpose of the CFDS is to identify the faulty aircraft equipment, record fault messages and display them in the cockpit for the flight crew.\n* AIDS reports (Aircraft Integrated Data System) - `aids_reports_01`, `aids_reports_02`, `aids_reports_04`, `aids_reports_05`, `aids_reports_06`, `aids_reports_07`, `aids_reports_09`, `aids_reports_10`, `aids_reports_11`, `aids_reports_13`, `aids_reports_14`, `aids_reports_15`, `aids_reports_19`. AIDS is used to log and monitor aircraft parameters and perfomance. Report type defines the set of parameters. The moment of the report generation is determined by the triggering conditions (see documentation).\n* `weather` - historical meteorological data for airports obtained from external source.\n \n \n### 1.1.3 Task specifics\n\nIn this task, we choose aircraft flight as the unit of observation (instead of time intervals). In this setting, the number of flights per day (0-6 flights) does not affect.\n\nThere are two types of CFDS messages: `Warning` and `Failure`. Most critical `Warning` messages are type of `MEL NO DISPATCH`: it is not permitted to dispatch the aircraft until the fault has been repaired.\n\nBy `event` we mean an appearance of at least one given message in a particular flight.\n\n\n### 1.1.4 Machine learning task\n\nGiven task is stated as a binary classification problem. Target vector is the chronological sequence of events:\n\n* `0` - event message will not occur in the next `W` flights\n* `1` - event message will occur in the next `W` flights\n\nThe task is to predict `ENG 2 FUEL FILTER CLOG` event message.\n\nParameter `W` is set as follows: `W=21`.\n\n\n### 1.1.5 Evaluation metrics for the given machine learning task\n\nIn this study, two metrics were selected as the evaluation criterions that are calculated for each model:\n\n* <a href='https://scikit-learn.org/stable/modules/generated/sklearn.metrics.roc_auc_score.html' target=_blank>roc_auc_score </a> \n* `max_f1_score` - maximum achievable <a href='https://en.wikipedia.org/wiki/F1_score' target=_blank>F1 score</a> over all thresholds\n",
      "ru": "<div class=\"anchor\" id=\"data-source\"></div>\n\n### 1.1. Краткое описание предметной области\n\n### 1.1.1 Введение\n\nВо время полета самолеты (воздушные суда, ВС) собирают очень много различной информацию о полете, состояние отдельных узлов самолета и состояние самолета в целом. Есть ряд определенных критичных событий возникновение которых требуют тщательной диагностики и устранения проблемы. Возникновение таких событий сильно влияет на работу авиакомпаний так, как им приходится оперативно устранять причину возникшего события или искать замену самолету. Это в свою очередь приводит к задержкам рейса и дополнительным расходам. Заблаговременное предсказание таких событий является крайне полезной информацией для авиакомпаний так, как они могут заранее произвести все необходимые подготовки и свести к минимум издержки.\n\n### 1.1.2 Источники данных\n\nВ задаче представлено несколько источников данных:\n\n* Расписание - `flights` - внутренняя система учета полетов ВС эксплуатанта(авиакомпании), содержит расписание полетов ВС\n\n* Система CFDS - `cfds_events` - автоматическая система самодиагностики и выявления поломок на борту ВС, содержит события отказов на борту ВС\n\n* Система AIDS - `aids_reports_01`, `aids_reports_02`, `aids_reports_04`, `aids_reports_05`, `aids_reports_06`, `aids_reports_07`, `aids_reports_09`, `aids_reports_10`, `aids_reports_11`, `aids_reports_13`, `aids_reports_14`, `aids_reports_15`, `aids_reports_19` - автоматическая система логирования параметров ВС, содержит параметры ВС на момент создания репорта. Список параметров определяется типом репорта, а момент создания определяется триггером на срабатывание (см. документацию)\n\n* Погодные данные - `weather` - внешний источник метерологических данных, содержит погодные данные по аэропортам в различные моменты времени\n \n\n### 1.1.3 Особенности постановки задачи\n\nДискретизация в задаче производится не по интервалам времени, а по совершенным полетам. Это необходимо, т.к. самолеты совершают существенно разное количество полетов в день (от 0 до ~6 полетов). \n\nСообщения диагностики в подсистеме CFDS самолета делятся на два класса - `Warning` и `Failure`. Часть `Warning` сообщений являются  `MEL NO DISPATCH` сообщениями, после их появления на самолете обязаны быть проведены работу по устранению данного класса сообщений, с запрещением дальнейших полетов до устранения.\n\nСобытием называется появление хотя-бы одного заданного сообщения в конкретном полете.\n\n### 1.1.4 Задача машинного обучения\n\nЗадача является задачей классификации. В виде таргета представлена упорядоченная во времени последовательность событий двух классов:\n\n* `0` - отсутствие появления индикатора события в ближайших `W` полетах\n\n* `1` - появление индикатора события в ближайших `W` полетах\n\nЗаданным событием является появление сообщения `ENG 2 FUEL FILTER CLOG` в полете.\n\nПараметр `W` = 21\n\n### 1.1.5 Метрики машинного обучения, используемые в задаче\n\nВ задаче используются две метрики: \n\n* <a href='https://scikit-learn.org/stable/modules/generated/sklearn.metrics.roc_auc_score.html' target=_blank>roc_auc_score </a>\n  \n* `max_f1_score` - максимальное значение <a href='https://en.wikipedia.org/wiki/F1_score' target=_blank>f1 score </a> полученное при переборе всевозможных порогов"
    },
    "authors": [
      "Eugene.Tcatcorin",
      "Eugenia.Chibisova",
      "Alexey.Savilov"
    ],
    "submits": 341,
    "favorite_submits": 3,
    "hidden_submits": 1,
    "comments": 9,
    "metrics_service_status": "OK"
  }
}
